In [1]:
import pandas as pd

In [2]:
pd.Series?

In [3]:
s1=pd.Series([1,2,3,4,5],index=[10,11,12,13,14])
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [4]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [5]:
s2=pd.Series(5,index=['a','b'])
s2

a    5
b    5
dtype: int64

In [6]:
d1={'a':101,'b':102,'c':103}
d1

{'a': 101, 'b': 102, 'c': 103}

In [7]:
s3=pd.Series(d1)
s3

a    101
b    102
c    103
dtype: int64

In [8]:
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [9]:
s2

a    5
b    5
dtype: int64

In [10]:
s3

a    101
b    102
c    103
dtype: int64

In [11]:
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [12]:
s1[10]

1

In [13]:
s1[14]

5

In [14]:
s2

a    5
b    5
dtype: int64

In [15]:
s2['a']

5

In [16]:
s3

a    101
b    102
c    103
dtype: int64

In [17]:
s3['c']

103

In [18]:
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [19]:
s1[:2]

10    1
11    2
dtype: int64

In [20]:
s1[1:-2]

11    2
12    3
dtype: int64

In [21]:
s1[14]

5

In [22]:
s1[:3]

10    1
11    2
12    3
dtype: int64

In [23]:
s1[-3:-1]

12    3
13    4
dtype: int64

In [24]:
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [25]:
s2

a    5
b    5
dtype: int64

In [26]:
s2['a']

5

In [27]:
s3

a    101
b    102
c    103
dtype: int64

In [28]:
s3[['a','c']]

a    101
c    103
dtype: int64

In [29]:
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [30]:
s1[[10,12,14]]

10    1
12    3
14    5
dtype: int64

In [31]:
pd.DataFrame?

In [32]:
df1=pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['a','b','c'])
df1

   a  b  c
a  1  2  3
b  4  5  6

In [33]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
dtypes: int64(3)
memory usage: 64.0+ bytes

In [35]:
df1.describe()

             a        b        c
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [36]:
df1

   a  b  c
a  1  2  3
b  4  5  6

In [37]:
df2=pd.DataFrame([['a','b','c'],['a','e','d']],index=['r1','r2'],columns=['c1','c2','c3'])
df2

   c1 c2 c3
r1  a  b  c
r2  a  e  d

In [38]:
df2.describe()

       c1 c2 c3
count   2  2  2
unique  1  2  2
top     a  e  c
freq    2  1  1

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, r1 to r2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      2 non-null      object
 1   c2      2 non-null      object
 2   c3      2 non-null      object
dtypes: object(3)
memory usage: 64.0+ bytes

In [40]:
df2.describe?

In [41]:
import numpy as np

In [42]:
arr1=np.array([[1,2,3,4],[5,6,7,8,]])
arr1

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [43]:
df3=pd.DataFrame(arr1)

In [44]:
df3

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [45]:
df4=pd.DataFrame(df2)
df4

   c1 c2 c3
r1  a  b  c
r2  a  e  d

In [46]:
d2={'Marks':[65,75,85,95],'Grade':['B','A','A+','A++']}
d2

{'Marks': [65, 75, 85, 95], 'Grade': ['B', 'A', 'A+', 'A++']}

In [47]:
df5=pd.DataFrame(d2)
df5

   Marks Grade
0     65     B
1     75     A
2     85    A+
3     95   A++

In [48]:
l1=[{'a':1,'b':2},{'a':3,'b':4},{'e':5,'f':6}]
l1

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}, {'e': 5, 'f': 6}]

In [49]:
df6=pd.DataFrame(l1)
df6

     a    b    e    f
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
2  NaN  NaN  5.0  6.0

In [50]:
df6.describe()

              a         b    e    f
count  2.000000  2.000000  1.0  1.0
mean   2.000000  3.000000  5.0  6.0
std    1.414214  1.414214  NaN  NaN
min    1.000000  2.000000  5.0  6.0
25%    1.500000  2.500000  5.0  6.0
50%    2.000000  3.000000  5.0  6.0
75%    2.500000  3.500000  5.0  6.0
max    3.000000  4.000000  5.0  6.0

In [51]:
df1

   a  b  c
a  1  2  3
b  4  5  6

In [52]:
df1['a']

a    1
b    4
Name: a, dtype: int64

In [53]:
print(type(df1['a']))

<class 'pandas.core.series.Series'>

In [54]:
df1

   a  b  c
a  1  2  3
b  4  5  6

In [55]:
df1['d']=pd.Series([10,20],index=['a','b'])

In [56]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [57]:
df1['e']=df1['a']+df1['b']
df1

   a  b  c   d  e
a  1  2  3  10  3
b  4  5  6  20  9

In [58]:
#del(df1['c'])

In [59]:
df1

   a  b  c   d  e
a  1  2  3  10  3
b  4  5  6  20  9

In [60]:
df1.pop?

In [61]:
df1

   a  b  c   d  e
a  1  2  3  10  3
b  4  5  6  20  9

In [62]:
df1.pop('e')

a    3
b    9
Name: e, dtype: int64

In [63]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [64]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [65]:
df1.loc?

In [66]:
df1.loc['a']

a     1
b     2
c     3
d    10
Name: a, dtype: int64

In [67]:
df1.loc['b']

a     4
b     5
c     6
d    20
Name: b, dtype: int64

In [68]:
df1.iloc?

In [69]:
df1.iloc[0]

a     1
b     2
c     3
d    10
Name: a, dtype: int64

In [70]:
df1.iloc[1]

a     4
b     5
c     6
d    20
Name: b, dtype: int64

In [71]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [72]:
df1[:]

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [73]:
df1[:1]

   a  b  c   d
a  1  2  3  10

In [74]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [75]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [76]:
df2

   c1 c2 c3
r1  a  b  c
r2  a  e  d

In [77]:
df1.append?

In [78]:
df1.append(df2,ignore_index=False)

      a    b    c     d   c1   c2   c3
a   1.0  2.0  3.0  10.0  NaN  NaN  NaN
b   4.0  5.0  6.0  20.0  NaN  NaN  NaN
r1  NaN  NaN  NaN   NaN    a    b    c
r2  NaN  NaN  NaN   NaN    a    e    d

In [79]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [80]:
df7=pd.DataFrame([[6,7,8],[1,2,3]],index=['a','b'],columns=['a','b','d'])
df7

   a  b  d
a  6  7  8
b  1  2  3

In [81]:
df1

   a  b  c   d
a  1  2  3  10
b  4  5  6  20

In [82]:
df8=df1.append(df7,ignore_index=True)

In [83]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [84]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [85]:
df8.drop(0)

   a  b    c   d
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [86]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [87]:
df9=pd.DataFrame(np.random.randn(4,3))
df9

          0         1         2
0 -0.042474 -0.065856 -0.965990
1  0.718372  0.555205 -2.699044
2 -0.898146  1.087039  0.937714
3  1.353430  1.257618  0.270464

In [88]:
s5=pd.Series(np.random.randn(8))
s5

0   -0.669346
1   -1.874018
2   -1.687264
3    1.158958
4    1.451487
5   -0.872168
6   -1.657060
7    0.763907
dtype: float64

In [89]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [90]:
s5

0   -0.669346
1   -1.874018
2   -1.687264
3    1.158958
4    1.451487
5   -0.872168
6   -1.657060
7    0.763907
dtype: float64

In [91]:
s5.head(2)

0   -0.669346
1   -1.874018
dtype: float64

In [92]:
s5.tail(2)

6   -1.657060
7    0.763907
dtype: float64

In [93]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [94]:
df8.head(2)

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20

In [95]:
df8.tail(2)

   a  b   c  d
2  6  7 NaN  8
3  1  2 NaN  3

In [96]:
s5

0   -0.669346
1   -1.874018
2   -1.687264
3    1.158958
4    1.451487
5   -0.872168
6   -1.657060
7    0.763907
dtype: float64

In [97]:
s5.values

array([-0.66934566, -1.87401764, -1.68726363,  1.15895784,  1.45148706,
       -0.8721682 , -1.65706041,  0.76390673])

In [98]:
s5.size

8

In [99]:
s5.ndim

1

In [100]:
s5.dtype

dtype('float64')

In [101]:
s5.axes

[RangeIndex(start=0, stop=8, step=1)]

In [102]:
s5

0   -0.669346
1   -1.874018
2   -1.687264
3    1.158958
4    1.451487
5   -0.872168
6   -1.657060
7    0.763907
dtype: float64

In [103]:
s2

a    5
b    5
dtype: int64

In [104]:
s2.axes

[Index(['a', 'b'], dtype='object')]

In [105]:
s5.empty

False

In [106]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [107]:
df8.T

      0     1    2    3
a   1.0   4.0  6.0  1.0
b   2.0   5.0  7.0  2.0
c   3.0   6.0  NaN  NaN
d  10.0  20.0  8.0  3.0

In [108]:
df8.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object')]

In [109]:
df8

   a  b    c   d
0  1  2  3.0  10
1  4  5  6.0  20
2  6  7  NaN   8
3  1  2  NaN   3

In [110]:
df8.dtypes

a      int64
b      int64
c    float64
d      int64
dtype: object

In [111]:
df8.ndim

2

In [112]:
df8.shape

(4, 4)

In [113]:
df8.empty

False

In [114]:
df8.size

16

In [115]:
df8.values

array([[ 1.,  2.,  3., 10.],
       [ 4.,  5.,  6., 20.],
       [ 6.,  7., nan,  8.],
       [ 1.,  2., nan,  3.]])

In [117]:
df1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['r1','r2','r3'],columns=['c1','c2','c3'])
df1

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9

In [121]:
df1['c1']

r1    1
r2    4
r3    7
Name: c1, dtype: int64

In [126]:
df1[::2]

    c1  c2  c3
r1   1   2   3
r3   7   8   9

In [127]:
df1.iloc[0]

c1    1
c2    2
c3    3
Name: r1, dtype: int64

In [128]:
df1.loc['r1']

c1    1
c2    2
c3    3
Name: r1, dtype: int64

In [132]:
df1

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9

In [133]:
df1.shape

(3, 3)

In [134]:
df1.ndim

2

In [135]:
df1.index

Index(['r1', 'r2', 'r3'], dtype='object')

In [137]:
df1.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [138]:
df1.columns=['c11','c22','c33']

In [139]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [140]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, r1 to r3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c11     3 non-null      int64
 1   c22     3 non-null      int64
 2   c33     3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [141]:
df1.count()

c11    3
c22    3
c33    3
dtype: int64

In [142]:
df1.describe()

       c11  c22  c33
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [143]:
df1.describe().T

     count  mean  std  min  25%  50%  75%  max
c11    3.0   4.0  3.0  1.0  2.5  4.0  5.5  7.0
c22    3.0   5.0  3.0  2.0  3.5  5.0  6.5  8.0
c33    3.0   6.0  3.0  3.0  4.5  6.0  7.5  9.0

In [144]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [152]:
df1.sum(axis=0)

c11    12
c22    15
c33    18
dtype: int64

In [150]:
df1.cumsum(axis=1)

    c11  c22  c33
r1    1    3    6
r2    4    9   15
r3    7   15   24

In [151]:
df1.sum?

In [153]:
df1.min()

c11    1
c22    2
c33    3
dtype: int64

In [154]:
df1.max()

c11    7
c22    8
c33    9
dtype: int64

In [155]:
df1.mean()

c11    4.0
c22    5.0
c33    6.0
dtype: float64

In [156]:
df1.median()

c11    4.0
c22    5.0
c33    6.0
dtype: float64

In [157]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [159]:
df1['c11'].mean()

4.0

In [160]:
df1.median()

c11    4.0
c22    5.0
c33    6.0
dtype: float64

In [161]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [162]:
df1.std()

c11    3.0
c22    3.0
c33    3.0
dtype: float64

In [163]:
df1.cumprod()

    c11  c22  c33
r1    1    2    3
r2    4   10   18
r3   28   80  162

In [164]:
df1.prod()

c11     28
c22     80
c33    162
dtype: int64

In [165]:
df1.mode()

   c11  c22  c33
0    1    2    3
1    4    5    6
2    7    8    9

In [166]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [169]:
f=lambda x: x*2

In [170]:
df1.apply(f)

    c11  c22  c33
r1    2    4    6
r2    8   10   12
r3   14   16   18

In [171]:
df1.applymap(f)

    c11  c22  c33
r1    2    4    6
r2    8   10   12
r3   14   16   18

In [172]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [178]:
df1['c11sqr']=df1['c11'].apply(lambda x:x**2)

In [179]:
df1

    c11  c22  c33  c11sqr
r1    1    2    3       1
r2    4    5    6      16
r3    7    8    9      49

In [182]:
df1

    c11  c22  c33  c11sqr
r1    1    2    3       1
r2    4    5    6      16
r3    7    8    9      49

In [187]:
df1.drop(columns=['c11sqr'],inplace=True)

In [185]:
df1.drop?

In [188]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [190]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer: Union[ForwardRef('PathLike[str]'), str, IO[~T], io.RawIOBase, io.BufferedIOBase, io.TextIOBase, _io.TextIOWrapper, mmap.mmap], sep=<object object at 0x0000008861D18220>, delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: str = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: Union[Dict[str, Any], NoneType] = None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
        .. versionchanged:: 1.2

           When ``encoding`` is ``None``, ``errors="replace"`` is passed to
           ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
           This behavior was previously only the case for ``engine="python"``.
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are ``None`` or 'high' for the ordinary converter,
        'legacy' for the original lower precision pandas converter, and
        'round_trip' for the round-trip converter.

        .. versionchanged:: 1.2

    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc., if using a URL that will
        be parsed by ``fsspec``, e.g., starting "s3://", "gcs://". An error
        will be raised if providing this argument with a non-fsspec URL.
        See the fsspec and backend storage implementation docs for the set of
        allowed keys and values.

        .. versionadded:: 1.2

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [191]:
df1

    c11  c22  c33
r1    1    2    3
r2    4    5    6
r3    7    8    9

In [193]:
df1.to_csv?

In [194]:
df1.to_csv('mydata.csv')

In [203]:
pd.read_csv?

In [218]:
df2=pd.read_csv('HousePrice.csv')

In [219]:
df2

      area  rooms     price
0   2104.0    3.0  399900.0
1   1600.0    3.0  329900.0
2   2400.0    3.0  369000.0
3   1416.0    2.0  232000.0
4   3000.0    4.0  539900.0
5   1985.0    4.0  299900.0
6   1534.0    3.0  314900.0
7   1427.0    3.0  198999.0
8   1380.0    3.0  212000.0
9   1494.0    3.0  242500.0
10  1940.0    4.0  239999.0
11  2000.0    3.0  347000.0
12  1890.0    3.0  329999.0
13  4478.0    5.0  699900.0
14  1268.0    3.0  259900.0
15  2300.0    4.0  449900.0
16  1320.0    2.0  299900.0
17  1236.0    3.0  199900.0
18  2609.0    4.0  499998.0
19  3031.0    4.0  599000.0
20  1767.0    3.0  252900.0
21  1888.0    2.0  255000.0
22  1604.0    3.0  242900.0
23  1962.0    4.0  259900.0
24  3890.0    3.0  573900.0
25  1100.0    3.0  249900.0
26  1458.0    3.0  464500.0
27  2526.0    3.0  469000.0
28  2200.0    3.0  475000.0
29  2637.0    3.0  299900.0
30  1839.0    2.0  349900.0
31  1000.0    1.0  169900.0
32  2040.0    4.0  314900.0
33  3137.0    3.0  579900.0
34  1811.0    4.0  285900.0
35  1437.0    3.0  249900.0
36  1239.0    3.0  229900.0
37  2132.0    4.0  345000.0
38  4215.0    4.0  549000.0
39  2162.0    4.0  287000.0
40  1664.0    2.0  368500.0
41  2238.0    3.0  329900.0
42  2567.0    4.0  314000.0
43  1200.0    3.0  299000.0
44   852.0    2.0  179900.0
45  1852.0    4.0  299900.0
46  1203.0    3.0  239500.0
47  1503.0    NaN  123456.0
48     NaN    2.0   56789.0
49  1200.0    NaN       NaN

In [220]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   area    49 non-null     float64
 1   rooms   48 non-null     float64
 2   price   49 non-null     float64
dtypes: float64(3)
memory usage: 1.3 KB

In [213]:
df2.columns=['area','no of rooms','price']

In [214]:
df2.head()

   area no of rooms   price
0  area       rooms   price
1  2104           3  399900
2  1600           3  329900
3  2400           3  369000
4  1416           2  232000

In [208]:
df2.tail()

    area  no of rooms   price
42  2567            4  314000
43  1200            3  299000
44   852            2  179900
45  1852            4  299900
46  1203            3  239500

In [221]:
df2

      area  rooms     price
0   2104.0    3.0  399900.0
1   1600.0    3.0  329900.0
2   2400.0    3.0  369000.0
3   1416.0    2.0  232000.0
4   3000.0    4.0  539900.0
5   1985.0    4.0  299900.0
6   1534.0    3.0  314900.0
7   1427.0    3.0  198999.0
8   1380.0    3.0  212000.0
9   1494.0    3.0  242500.0
10  1940.0    4.0  239999.0
11  2000.0    3.0  347000.0
12  1890.0    3.0  329999.0
13  4478.0    5.0  699900.0
14  1268.0    3.0  259900.0
15  2300.0    4.0  449900.0
16  1320.0    2.0  299900.0
17  1236.0    3.0  199900.0
18  2609.0    4.0  499998.0
19  3031.0    4.0  599000.0
20  1767.0    3.0  252900.0
21  1888.0    2.0  255000.0
22  1604.0    3.0  242900.0
23  1962.0    4.0  259900.0
24  3890.0    3.0  573900.0
25  1100.0    3.0  249900.0
26  1458.0    3.0  464500.0
27  2526.0    3.0  469000.0
28  2200.0    3.0  475000.0
29  2637.0    3.0  299900.0
30  1839.0    2.0  349900.0
31  1000.0    1.0  169900.0
32  2040.0    4.0  314900.0
33  3137.0    3.0  579900.0
34  1811.0    4.0  285900.0
35  1437.0    3.0  249900.0
36  1239.0    3.0  229900.0
37  2132.0    4.0  345000.0
38  4215.0    4.0  549000.0
39  2162.0    4.0  287000.0
40  1664.0    2.0  368500.0
41  2238.0    3.0  329900.0
42  2567.0    4.0  314000.0
43  1200.0    3.0  299000.0
44   852.0    2.0  179900.0
45  1852.0    4.0  299900.0
46  1203.0    3.0  239500.0
47  1503.0    NaN  123456.0
48     NaN    2.0   56789.0
49  1200.0    NaN       NaN

In [222]:
df2.count()

area     49
rooms    48
price    49
dtype: int64

In [223]:
df2.isnull()

     area  rooms  price
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False
12  False  False  False
13  False  False  False
14  False  False  False
15  False  False  False
16  False  False  False
17  False  False  False
18  False  False  False
19  False  False  False
20  False  False  False
21  False  False  False
22  False  False  False
23  False  False  False
24  False  False  False
25  False  False  False
26  False  False  False
27  False  False  False
28  False  False  False
29  False  False  False
30  False  False  False
31  False  False  False
32  False  False  False
33  False  False  False
34  False  False  False
35  False  False  False
36  False  False  False
37  False  False  False
38  False  False  False
39  False  False  False
40  False  False  False
41  False  False  False
42  False  False  False
43  False  False  False
44  False  False  False
45  False  False  False
46  False  False  False
47  False   True  False
48   True  False  False
49  False   True   True

In [227]:
df2

      area  rooms     price
0   2104.0    3.0  399900.0
1   1600.0    3.0  329900.0
2   2400.0    3.0  369000.0
3   1416.0    2.0  232000.0
4   3000.0    4.0  539900.0
5   1985.0    4.0  299900.0
6   1534.0    3.0  314900.0
7   1427.0    3.0  198999.0
8   1380.0    3.0  212000.0
9   1494.0    3.0  242500.0
10  1940.0    4.0  239999.0
11  2000.0    3.0  347000.0
12  1890.0    3.0  329999.0
13  4478.0    5.0  699900.0
14  1268.0    3.0  259900.0
15  2300.0    4.0  449900.0
16  1320.0    2.0  299900.0
17  1236.0    3.0  199900.0
18  2609.0    4.0  499998.0
19  3031.0    4.0  599000.0
20  1767.0    3.0  252900.0
21  1888.0    2.0  255000.0
22  1604.0    3.0  242900.0
23  1962.0    4.0  259900.0
24  3890.0    3.0  573900.0
25  1100.0    3.0  249900.0
26  1458.0    3.0  464500.0
27  2526.0    3.0  469000.0
28  2200.0    3.0  475000.0
29  2637.0    3.0  299900.0
30  1839.0    2.0  349900.0
31  1000.0    1.0  169900.0
32  2040.0    4.0  314900.0
33  3137.0    3.0  579900.0
34  1811.0    4.0  285900.0
35  1437.0    3.0  249900.0
36  1239.0    3.0  229900.0
37  2132.0    4.0  345000.0
38  4215.0    4.0  549000.0
39  2162.0    4.0  287000.0
40  1664.0    2.0  368500.0
41  2238.0    3.0  329900.0
42  2567.0    4.0  314000.0
43  1200.0    3.0  299000.0
44   852.0    2.0  179900.0
45  1852.0    4.0  299900.0
46  1203.0    3.0  239500.0
47  1503.0    NaN  123456.0
48     NaN    2.0   56789.0
49  1200.0    NaN       NaN

In [230]:
df2.count()

area     49
rooms    48
price    49
dtype: int64

In [231]:
df2.isna().sum()

area     1
rooms    2
price    1
dtype: int64